<?php

return [

    'registered' => 'تم تسجيل المستخدم بنجاح.',
    'otp_sent' => 'تم إرسال رمز التحقق بنجاح.',
    'otp_verified' => 'تم التحقق من رمز التحقق بنجاح.',
    'password_reset' => 'تم إعادة تعيين كلمة المرور بنجاح.',
    'email_not_found' => 'البريد الإلكتروني غير موجود.',
    'invalid_otp' => 'رمز التحقق غير صحيح.',
    'invalid_or_expired_otp' => 'رمز التحقق غير صحيح أو منتهي الصلاحية.',
    'otp_resent' => 'تم إعادة إرسال رمز التحقق بنجاح.',
    'validation' => [
        'name' => [
            'required' => 'حقل الاسم مطلوب.',
            'string' => 'يجب أن يكون الاسم نصًا.',
            'min' => 'يجب ألا يقل الاسم عن :min أحرف.',
            'max' => 'يجب ألا يتجاوز الاسم :max حرفًا.',
        ],

        'email' => [
            'required' => 'حقل البريد الإلكتروني مطلوب.',
            'email' => 'يجب أن يكون البريد الإلكتروني صحيحًا.',
            'max' => 'يجب ألا يتجاوز البريد الإلكتروني :max حرفًا.',
            'unique' => 'البريد الإلكتروني مستخدم بالفعل.',
        ],

        'phone' => [
            'string' => 'يجب أن يكون رقم الهاتف نصًا.',
            'max' => 'يجب ألا يتجاوز رقم الهاتف :max حرفًا.',
            'unique' => 'رقم الهاتف مستخدم بالفعل.',
        ],

        'password' => [
            'required' => 'حقل كلمة المرور مطلوب.',
            'confirmed' => 'تأكيد كلمة المرور غير متطابق.',
        ],
    ],
];