<?php

return [

    'created' => 'تم إنشاء موقع الشركة بنجاح.',

    'updated' => 'تم تحديث موقع الشركة بنجاح.',

    'deactivated' => 'تم إلغاء تفعيل موقع الشركة بنجاح.',

    'activated' => 'تم تفعيل موقع الشركة بنجاح.',

    'active_retrieved' => 'تم استرجاع موقع الشركة النشط بنجاح.',

    'already_exists' => 'الشركة لديها موقع مسجل بالفعل.',

    'latitude_invalid' => 'يجب أن تكون قيمة خط العرض بين -90 و90.',

    'longitude_invalid' => 'يجب أن تكون قيمة خط الطول بين -180 و180.',

    'radius_invalid' => 'يجب أن يكون نصف القطر أكبر من صفر.',
    'no_fields_to_update' => 'يرجى إدخال حقل واحد على الأقل لتحديثه.',

];